app/Controllers/UserController.php

    public function userLogin(){

        if ($this->request->getMethod() === "get") {
            return view('login');
        }else if($this->request->getMethod() == "post"){
            $rules = [
                'username' => 'required',
                'password' => 'required'

            ];
            // if ($this->validate([
            //     'username' => 'required',
            //     'password' => 'required'
            // ])) {
            //     # code...
            // }else{
            //     return redirect()->back()->withInput();
            // }
            if (!$this->validate($rules)) {
                return view('login',[
                    'validation' => $this->validator
                ]);
            }else{
                $user = new UserModel();
                $username = $this->request->getVar('username');
                $password = $this->request->getVar('password');
                $record = $user->where("username", $username)
                         ->where("password", $password)
                         ->first();
---
SELECT *
FROM `tbl_user`
WHERE `username` = 'rahul01'
AND `password` = '0'
 LIMIT 1